servicemix-osgi/soap-hbr/result.txt
christian-muellers-macbook-pro:soap-hbr cmueller$ ab -n 10000 -c 20 -p 1K_buyStocks.xml -T text/xml http://localhost:8192/service/CBRSOAPHeaderProxy
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Jetty(7.5.4.v20111024)
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/CBRSOAPHeaderProxy
Document Length:        1293 bytes

Concurrency Level:      20
Time taken for tests:   1.243 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Non-2xx responses:      10007
Total transferred:      14680269 bytes
Total POSTed:           11798253
HTML transferred:       12939051 bytes
Requests per second:    8046.20 [#/sec] (mean)
Time per request:       2.486 [ms] (mean)
Time per request:       0.124 [ms] (mean, across all concurrent requests)
Transfer rate:          11535.20 [Kbytes/sec] received
                        9270.62 kb/s sent
                        20805.82 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0      11
Processing:     0    2   0.9      2      14
Waiting:        0    1   0.7      1      12
Total:          1    2   1.0      2      15
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      3
  90%      3
  95%      4
  98%      5
  99%      6
 100%     15 (longest request)